uhnp/src/Documents/УдалитьРегистрацияОстатковДЗО/УдалитьРегистрацияОстатковДЗО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УдалитьРегистрацияОстатковДЗО</name>
  <registerRecords>InformationRegister.НоменклатураНаСкладахДЗО</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЦен</name>
    <type>
      <types>DefinedType.ТипЦенНоменклатуры</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОстаткиНоменклатуры</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>DefinedType.ТипЕдиницаИзмеренияЕХ</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>DefinedType.КоэффициентЕдиницыИзмеренияУХ</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

uhnp/src/InformationRegisters/НастройкаЗаменыНоменклатуры/НастройкаЗаменыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкаЗаменыНоменклатуры</name>
  <resources>
    <name>Коэффициент</name>
    <comment>Если количество в единицах источника умножить на коэффициент, то получим количество в единицах приемника</comment>
    <type>
      <types>DefinedType.КоэффициентЕдиницыИзмеренияУХ</types>
    </type>
  </resources>
  <dimensions>
    <name>СпособЗамены</name>
    <type>
      <types>EnumRef.СпособыЗаменыНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НоменклатураИсточник</name>
    <type>
      <types>DefinedType.ТипНоменклатураЕХ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаИсточник</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЕдиницаИзмеренияИсточник</name>
    <type>
      <types>DefinedType.ТипЕдиницаИзмеренияЕХ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НоменклатураПриемник</name>
    <type>
      <types>DefinedType.ТипНоменклатураЕХ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаПриемник</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЕдиницаИзмеренияПриемник</name>
    <type>
      <types>DefinedType.ТипЕдиницаИзмеренияЕХ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/НоменклатураНаСкладахДЗО/НоменклатураНаСкладахДЗО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НоменклатураНаСкладахДЗО</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Enums/СпособыЗаменыНоменклатуры/СпособыЗаменыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыЗаменыНоменклатуры</name>
  <enumValues>
    <name>ПересчетЕдиницыИзмерения</name>
  </enumValues>
  <enumValues>
    <name>Унификат</name>
  </enumValues>
  <enumValues>
    <name>Аналоги</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Documents/УдалитьРегистрацияОстатковДЗО/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РегистрацияОстатковДЗООстаткиНоменклатуры.Номенклатура КАК Номенклатура,
		|	РегистрацияОстатковДЗООстаткиНоменклатуры.Характеристика КАК Характеристика,
		|	МИНИМУМ(РегистрацияОстатковДЗООстаткиНоменклатуры.Коэффициент) КАК Коэффициент,
		|	РегистрацияОстатковДЗООстаткиНоменклатуры.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	СУММА(РегистрацияОстатковДЗООстаткиНоменклатуры.Количество) КАК Количество,
		|	МАКСИМУМ(РегистрацияОстатковДЗООстаткиНоменклатуры.Номенклатура.ЕдиницаИзмерения) КАК ЕдиницаИзмеренияБазовая,
		|	РегистрацияОстатковДЗООстаткиНоменклатуры.Ссылка.Организация КАК Организация,
		|	РегистрацияОстатковДЗООстаткиНоменклатуры.Ссылка.Склад КАК Склад,
		|	РегистрацияОстатковДЗООстаткиНоменклатуры.Сумма КАК Сумма
		|ПОМЕСТИТЬ НоменклатураДокумента
		|ИЗ
		|	Документ.УдалитьРегистрацияОстатковДЗО.ОстаткиНоменклатуры КАК РегистрацияОстатковДЗООстаткиНоменклатуры
		|ГДЕ
		|	РегистрацияОстатковДЗООстаткиНоменклатуры.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	РегистрацияОстатковДЗООстаткиНоменклатуры.Номенклатура,
		|	РегистрацияОстатковДЗООстаткиНоменклатуры.ЕдиницаИзмерения,
		|	РегистрацияОстатковДЗООстаткиНоменклатуры.Ссылка.Склад,
		|	РегистрацияОстатковДЗООстаткиНоменклатуры.Ссылка.Организация,
		|	РегистрацияОстатковДЗООстаткиНоменклатуры.Сумма,
		|	РегистрацияОстатковДЗООстаткиНоменклатуры.Характеристика
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НоменклатураДокумента.Номенклатура КАК Номенклатура,
		|	НоменклатураДокумента.Количество * ВЫБОР
		|		КОГДА НастройкаЗаменыНоменклатуры.Коэффициент ЕСТЬ NULL
		|			ТОГДА НоменклатураДокумента.Коэффициент
		|		ИНАЧЕ НастройкаЗаменыНоменклатуры.Коэффициент
		|	КОНЕЦ КАК Количество,
		|	НоменклатураДокумента.Склад КАК Склад,
		|	НоменклатураДокумента.Организация КАК Организация,
		|	НоменклатураДокумента.Сумма * ВЫБОР
		|		КОГДА НастройкаЗаменыНоменклатуры.Коэффициент ЕСТЬ NULL
		|			ТОГДА НоменклатураДокумента.Коэффициент
		|		ИНАЧЕ НастройкаЗаменыНоменклатуры.Коэффициент
		|	КОНЕЦ КАК Сумма
		|ИЗ
		|	НоменклатураДокумента КАК НоменклатураДокумента
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкаЗаменыНоменклатуры КАК НастройкаЗаменыНоменклатуры
		|		ПО (НастройкаЗаменыНоменклатуры.СпособЗамены = &СпособЗамены)
		|			И НоменклатураДокумента.Номенклатура = НастройкаЗаменыНоменклатуры.НоменклатураИсточник
		|			И НоменклатураДокумента.Номенклатура = НастройкаЗаменыНоменклатуры.НоменклатураПриемник
		|			И НоменклатураДокумента.ЕдиницаИзмеренияБазовая = НастройкаЗаменыНоменклатуры.ЕдиницаИзмеренияИсточник
		|			И НоменклатураДокумента.ЕдиницаИзмерения = НастройкаЗаменыНоменклатуры.НоменклатураПриемник
		|			И НоменклатураДокумента.Характеристика = НастройкаЗаменыНоменклатуры.ХарактеристикаИсточник
		|			И НоменклатураДокумента.Характеристика = НастройкаЗаменыНоменклатуры.ХарактеристикаПриемник";
	
	Запрос.УстановитьПараметр("СпособЗамены", Перечисления.СпособыЗаменыНоменклатуры.ПересчетЕдиницыИзмерения);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	// регистр ТоварыНаСкладахДЗО
	Движения.НоменклатураНаСкладахДЗО.Записывать = Истина;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Движение = Движения.НоменклатураНаСкладахДЗО.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, ВыборкаДетальныеЗаписи);
		Движение.Период = Дата;
	КонецЦикла;

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(ТипЦен) Тогда
		ТипЦен = Константы.ТипЦенДляРасценкиЗаявокНаПотребность.Получить();
	КонецЕсли;
КонецПроцедуры

#КонецЕсли
